Terraform plan for __production__
<details>
<summary>Plan: 1 to add, 9 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # cloudfoundry_user_provided_service.ssb-solrcloud-k8s will be updated in-place
  ~ resource "cloudfoundry_user_provided_service" "ssb-solrcloud-k8s" {
      ~ credentials_json = (sensitive value)
        id               = "140e50d0-8b21-4c03-b84a-5a9e4098a518"
        name             = "ssb-solrcloud-k8s"
        tags             = []
        # (1 unchanged attribute hidden)
    }

  # module.broker_eks.cloudfoundry_service_broker.space_scoped_broker["gsa-datagov/development"] will be updated in-place
  ~ resource "cloudfoundry_service_broker" "space_scoped_broker" {
      ~ catalog_change                   = true -> false
        id                               = "6f4b1969-41f1-426a-a251-22ae0810e470"
        name                             = "ssb-eks-gsa-datagov-development"
        # (8 unchanged attributes hidden)
    }

  # module.broker_eks.cloudfoundry_service_broker.space_scoped_broker["gsa-datagov/management"] will be updated in-place
  ~ resource "cloudfoundry_service_broker" "space_scoped_broker" {
      ~ catalog_change                   = true -> false
        id                               = "a0a3aed6-3930-4a2b-839e-1eaf93e4eb56"
        name                             = "ssb-eks-gsa-datagov-management"
        # (8 unchanged attributes hidden)
    }

  # module.broker_eks.cloudfoundry_service_broker.space_scoped_broker["gsa-datagov/prod"] will be updated in-place
  ~ resource "cloudfoundry_service_broker" "space_scoped_broker" {
      ~ catalog_change                   = true -> false
        id                               = "f551b0db-09e4-4b55-8358-e0385b0c2bf6"
        name                             = "ssb-eks-gsa-datagov-prod"
        # (8 unchanged attributes hidden)
    }

  # module.broker_eks.cloudfoundry_service_broker.space_scoped_broker["gsa-datagov/staging"] will be updated in-place
  ~ resource "cloudfoundry_service_broker" "space_scoped_broker" {
      ~ catalog_change                   = true -> false
        id                               = "e2dad6fb-53ec-461f-a1f0-a707d6b790b9"
        name                             = "ssb-eks-gsa-datagov-staging"
        # (8 unchanged attributes hidden)
    }

  # module.brokerpak-eks-terraform.module.bind.data.aws_eks_cluster.main will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster" "main"  {
      ~ arn                       = "arn:aws:eks:us-west-2:821341638715:cluster/k8s-d6e0b7fc580c3a4d" -> (known after apply)
      ~ certificate_authority     = [
          - {
              - data = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUM1ekNDQWMrZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJeU1ETXdNekUzTlRVek9Wb1hEVE15TURJeU9URTNOVFV6T1Zvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTThWCjhpTWdVQmF5RmdockU2WFRUcFFRNFU5YmVqbVM3QVBtQi9yMExpeUovUVFtcHVVVmNHNEVzUDlIcmJqbHl5ZGUKUVNkSldEZEloRkRXeVJKQVExRXZPaXdQcEJpb01lT2VIMDhmbDdXVWZIN1Y0enhWODNmTGhGeWh0S1lXV1E0NQpQVlFwak5mdnpUNWpKQUd2YXd2TWlGWWxLNWRHanJPdUYyMktlazVVeWJmbnZiMHdXUS80SytEWDlGai9BMjdBCmtmV2VnSEdtUFB4U0RqQ0REcTZLK3pDRlNuRU11aDl0MXlUK3RPREdnNHFqK2NHdGM0WTk0L1FrVGMxMkhhVGoKc2dtWjh2MmZONlg0UFk0QzNZVktDbzA3Y09KUTNFcUFDdkFlZW0wTU16aW1IWXJuZE9sVjlTT3ZMMUVQZWJVRQpjSlhyaE9UM05QaDVGZmlHQW8wQ0F3RUFBYU5DTUVBd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0hRWURWUjBPQkJZRUZHUUJkdmZ0KzFza1NTTUlDa3N1SVcraFNJNWlNQTBHQ1NxR1NJYjMKRFFFQkN3VUFBNElCQVFDMGwvODkwMzRxOFhraG5TdkRsRUcxOFo4RXZ5V3FWR3JZdmtWc3MrQU1NdjNqdERKZApOSEFBNGJUdlM0NGtSN2ZUV0FXWlh3M1RHeDdrQXhEL2RtalNhVkVxYnorTWxlcTVSYTYvNTdnU2dvTGZkQzBqCnZNN1VnUmJORHJlUWdJQ2Y5MnR2Mnh4bG5IQjNuVnhNdWlydzVGUlZaOW4zaHRPVlp0UDJZZFptUFQyNVpxc0EKQTI4NjJKcnZTV1ZtTWROZDRqd3hsZ0ROUlpHUVlWeGlGbVhxdVdMTVRXVWd4NkNnSkdiNlFDSEQxNkpYOEhPegpjSkRpVG0wL3FyVHljTVp6TWc5YlFZaWh3bC9IYVovN1ZxcWdkVGhOKzBjUFhZYVFVTlZiTmZqeGdiQ2ZVMHFqCll5OVhYeS93N0dMdUs5NFRpcnZIQU14TXZsL05jb0tqWTZEZQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
            },
        ] -> (known after apply)
      ~ created_at                = "2022-03-03 17:49:14.931 +0000 UTC" -> (known after apply)
      ~ enabled_cluster_log_types = [
          - "api",
          - "audit",
          - "authenticator",
          - "controllerManager",
          - "scheduler",
        ] -> (known after apply)
      ~ endpoint                  = "https://B3BA57C48C223D301BFC0E8B6092D1B7.sk1.us-west-2.eks.amazonaws.com" -> (known after apply)
      ~ id                        = "********************" -> (known after apply)
      ~ identity                  = [
          - {
              - oidc = [
                  - {
                      - issuer = "https://oidc.eks.us-west-2.amazonaws.com/id/B3BA57C48C223D301BFC0E8B6092D1B7"
                    },
                ]
            },
        ] -> (known after apply)
      ~ kubernetes_network_config = [
          - {
              - ip_family         = "ipv4"
              - service_ipv4_cidr = "172.20.0.0/16"
            },
        ] -> (known after apply)
        name                      = "k8s-d6e0b7fc580c3a4d"
      ~ platform_version          = "eks.4" -> (known after apply)
      ~ role_arn                  = "arn:aws:iam::821341638715:role/k8s-d6e0b7fc580c3a4d-cluster-20220303174638717300000003" -> (known after apply)
      ~ status                    = "ACTIVE" -> (known after apply)
      ~ tags                      = {
          - "domain" = "solrcloud-k8s.ssb.data.gov"
        } -> (known after apply)
      ~ version                   = "1.21" -> (known after apply)
      ~ vpc_config                = [
          - {
              - cluster_security_group_id = "********************"
              - endpoint_private_access   = false
              - endpoint_public_access    = true
              - public_access_cidrs       = [
                  - "0.0.0.0/0",
                ]
              - security_group_ids        = [
                  - "sg-05b3c6ab8ba4310ae",
                ]
              - subnet_ids                = [
                  - "subnet-007e6f63e73ede610",
                  - "subnet-00bd6b66d9fd6ad48",
                  - "subnet-0e416adf62875f88a",
                ]
              - vpc_id                    = "*********************"
            },
        ] -> (known after apply)
    }

  # module.brokerpak-eks-terraform.module.bind.data.aws_eks_cluster_auth.main will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster_auth" "main"  {
      ~ id    = "********************" -> (known after apply)
        name  = "k8s-d6e0b7fc580c3a4d"
      ~ token = (sensitive value)
    }

  # module.brokerpak-eks-terraform.module.bind.data.kubernetes_secret.secret will be read during apply
  # (config refers to values not yet known)
 <= data "kubernetes_secret" "secret"  {
      ~ data      = (sensitive value)
      ~ id        = "************************************" -> (known after apply)
      ~ immutable = false -> (known after apply)
      ~ type      = "kubernetes.io/service-account-token" -> (known after apply)

      ~ metadata {
          - annotations      = {} -> null
          ~ generation       = 0 -> (known after apply)
          - labels           = {} -> null
            name             = "95b475a54670fc2a-token-98zkg"
          ~ resource_version = "5433" -> (known after apply)
          ~ uid              = "e3deae22-3b8d-446a-b8d0-b559a311efa3" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # module.brokerpak-eks-terraform.module.bind.data.template_file.kubeconfig will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "kubeconfig"  {
      ~ id       = "****************************************************************" -> (known after apply)
      ~ rendered = <<-EOT
            apiVersion: v1
            kind: Config
            users:
            - name: 95b475a54670fc2a
              user:
                token: eyJhbGciOiJSUzI1NiIsImtpZCI6InZJRzU5SnQ1cXBETnM0YjJuczl1WHdlUkxtUExkR1VBcjlQbFc5YTFxU0kifQ.eyJpc3MiOiJrdWJlcm5ldGVzL3NlcnZpY2VhY2NvdW50Iiwia3ViZXJuZXRlcy5pby9zZXJ2aWNlYWNjb3VudC9uYW1lc3BhY2UiOiJkZWZhdWx0Iiwia3ViZXJuZXRlcy5pby9zZXJ2aWNlYWNjb3VudC9zZWNyZXQubmFtZSI6Ijk1YjQ3NWE1NDY3MGZjMmEtdG9rZW4tOTh6a2ciLCJrdWJlcm5ldGVzLmlvL3NlcnZpY2VhY2NvdW50L3NlcnZpY2UtYWNjb3VudC5uYW1lIjoiOTViNDc1YTU0NjcwZmMyYSIsImt1YmVybmV0ZXMuaW8vc2VydmljZWFjY291bnQvc2VydmljZS1hY2NvdW50LnVpZCI6IjkzZjg4NTkxLWE4MDYtNGU2Mi1iOWJlLTgxY2YwODhjNjBlZSIsInN1YiI6InN5c3RlbTpzZXJ2aWNlYWNjb3VudDpkZWZhdWx0Ojk1YjQ3NWE1NDY3MGZjMmEifQ.atUvCtC6HZqlSOfplkA2wStUWyI8WPbYWO17ozfciCExJXjWKVF6TyEbAwuRh9_ctPsAX4SXMP1AzzwkKoU1-oIDO4or5OHWTFR1f0JbxXbqGcorckS0D-ejb3POXzrq-YFEA3oYLzrAFWtwNNMFJME_ULm_EfEl5QQS14CYn_AZAu2qglXBhkxNMdJNSazm2i6e-MzSE90h7b-Und2-Zvr06jJ6SG63MAMo3qVya6Hvh5ifJadffPTCfptGQquahabx0yA8xagHg-mES_RDAx2KfLxhTg_6lK2ElVRLFvQkmBF-Z-3OIG4B3Sm-a094ETVAlYghcEbiC8o094PrjQ
            clusters:
            - cluster:
                certificate-authority-data: LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUM1ekNDQWMrZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJeU1ETXdNekUzTlRVek9Wb1hEVE15TURJeU9URTNOVFV6T1Zvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTThWCjhpTWdVQmF5RmdockU2WFRUcFFRNFU5YmVqbVM3QVBtQi9yMExpeUovUVFtcHVVVmNHNEVzUDlIcmJqbHl5ZGUKUVNkSldEZEloRkRXeVJKQVExRXZPaXdQcEJpb01lT2VIMDhmbDdXVWZIN1Y0enhWODNmTGhGeWh0S1lXV1E0NQpQVlFwak5mdnpUNWpKQUd2YXd2TWlGWWxLNWRHanJPdUYyMktlazVVeWJmbnZiMHdXUS80SytEWDlGai9BMjdBCmtmV2VnSEdtUFB4U0RqQ0REcTZLK3pDRlNuRU11aDl0MXlUK3RPREdnNHFqK2NHdGM0WTk0L1FrVGMxMkhhVGoKc2dtWjh2MmZONlg0UFk0QzNZVktDbzA3Y09KUTNFcUFDdkFlZW0wTU16aW1IWXJuZE9sVjlTT3ZMMUVQZWJVRQpjSlhyaE9UM05QaDVGZmlHQW8wQ0F3RUFBYU5DTUVBd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0hRWURWUjBPQkJZRUZHUUJkdmZ0KzFza1NTTUlDa3N1SVcraFNJNWlNQTBHQ1NxR1NJYjMKRFFFQkN3VUFBNElCQVFDMGwvODkwMzRxOFhraG5TdkRsRUcxOFo4RXZ5V3FWR3JZdmtWc3MrQU1NdjNqdERKZApOSEFBNGJUdlM0NGtSN2ZUV0FXWlh3M1RHeDdrQXhEL2RtalNhVkVxYnorTWxlcTVSYTYvNTdnU2dvTGZkQzBqCnZNN1VnUmJORHJlUWdJQ2Y5MnR2Mnh4bG5IQjNuVnhNdWlydzVGUlZaOW4zaHRPVlp0UDJZZFptUFQyNVpxc0EKQTI4NjJKcnZTV1ZtTWROZDRqd3hsZ0ROUlpHUVlWeGlGbVhxdVdMTVRXVWd4NkNnSkdiNlFDSEQxNkpYOEhPegpjSkRpVG0wL3FyVHljTVp6TWc5YlFZaWh3bC9IYVovN1ZxcWdkVGhOKzBjUFhZYVFVTlZiTmZqeGdiQ2ZVMHFqCll5OVhYeS93N0dMdUs5NFRpcnZIQU14TXZsL05jb0tqWTZEZQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg==
                server: https://B3BA57C48C223D301BFC0E8B6092D1B7.sk1.us-west-2.eks.amazonaws.com
              name: k8s-d6e0b7fc580c3a4d
            contexts:
            - context:
                cluster: k8s-d6e0b7fc580c3a4d
                namespace: default
                user: 95b475a54670fc2a
              name: k8s-d6e0b7fc580c3a4d-default-95b475a54670fc2a
            current-context: k8s-d6e0b7fc580c3a4d-default-95b475a54670fc2a
        EOT -> (known after apply)
      # Warning: this attribute value will no longer be marked as sensitive
      # after applying this change.
      ~ template = (sensitive) -> (known after apply)
    }

  # module.brokerpak-eks-terraform.module.provision.local_file.kubeconfig[0] will be created
  + resource "local_file" "kubeconfig" {
      + directory_permission = "0777"
      + file_permission      = "0600"
      + filename             = "kubeconfig-k8s-d6e0b7fc580c3a4d"
      + id                   = (known after apply)
      + sensitive_content    = (sensitive value)
    }

  # module.brokerpak-eks-terraform.module.provision.module.aws_load_balancer_controller.data.aws_caller_identity.current will be read during apply
  # (config refers to values not yet known)
 <= data "aws_caller_identity" "current"  {
      ~ account_id = "************" -> (known after apply)
      ~ arn        = "arn:aws:iam::821341638715:user/ssb-eks-broker" -> (known after apply)
      ~ id         = "************" -> (known after apply)
      ~ user_id    = "*********************" -> (known after apply)
    }

  # module.brokerpak-eks-terraform.module.provision.module.aws_load_balancer_controller.data.aws_eks_cluster.selected[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster" "selected"  {
      ~ arn                       = "arn:aws:eks:us-west-2:821341638715:cluster/k8s-d6e0b7fc580c3a4d" -> (known after apply)
      ~ certificate_authority     = [
          - {
              - data = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUM1ekNDQWMrZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJeU1ETXdNekUzTlRVek9Wb1hEVE15TURJeU9URTNOVFV6T1Zvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTThWCjhpTWdVQmF5RmdockU2WFRUcFFRNFU5YmVqbVM3QVBtQi9yMExpeUovUVFtcHVVVmNHNEVzUDlIcmJqbHl5ZGUKUVNkSldEZEloRkRXeVJKQVExRXZPaXdQcEJpb01lT2VIMDhmbDdXVWZIN1Y0enhWODNmTGhGeWh0S1lXV1E0NQpQVlFwak5mdnpUNWpKQUd2YXd2TWlGWWxLNWRHanJPdUYyMktlazVVeWJmbnZiMHdXUS80SytEWDlGai9BMjdBCmtmV2VnSEdtUFB4U0RqQ0REcTZLK3pDRlNuRU11aDl0MXlUK3RPREdnNHFqK2NHdGM0WTk0L1FrVGMxMkhhVGoKc2dtWjh2MmZONlg0UFk0QzNZVktDbzA3Y09KUTNFcUFDdkFlZW0wTU16aW1IWXJuZE9sVjlTT3ZMMUVQZWJVRQpjSlhyaE9UM05QaDVGZmlHQW8wQ0F3RUFBYU5DTUVBd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0hRWURWUjBPQkJZRUZHUUJkdmZ0KzFza1NTTUlDa3N1SVcraFNJNWlNQTBHQ1NxR1NJYjMKRFFFQkN3VUFBNElCQVFDMGwvODkwMzRxOFhraG5TdkRsRUcxOFo4RXZ5V3FWR3JZdmtWc3MrQU1NdjNqdERKZApOSEFBNGJUdlM0NGtSN2ZUV0FXWlh3M1RHeDdrQXhEL2RtalNhVkVxYnorTWxlcTVSYTYvNTdnU2dvTGZkQzBqCnZNN1VnUmJORHJlUWdJQ2Y5MnR2Mnh4bG5IQjNuVnhNdWlydzVGUlZaOW4zaHRPVlp0UDJZZFptUFQyNVpxc0EKQTI4NjJKcnZTV1ZtTWROZDRqd3hsZ0ROUlpHUVlWeGlGbVhxdVdMTVRXVWd4NkNnSkdiNlFDSEQxNkpYOEhPegpjSkRpVG0wL3FyVHljTVp6TWc5YlFZaWh3bC9IYVovN1ZxcWdkVGhOKzBjUFhZYVFVTlZiTmZqeGdiQ2ZVMHFqCll5OVhYeS93N0dMdUs5NFRpcnZIQU14TXZsL05jb0tqWTZEZQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
            },
        ] -> (known after apply)
      ~ created_at                = "2022-03-03 17:49:14.931 +0000 UTC" -> (known after apply)
      ~ enabled_cluster_log_types = [
          - "api",
          - "audit",
          - "authenticator",
          - "controllerManager",
          - "scheduler",
        ] -> (known after apply)
      ~ endpoint                  = "https://B3BA57C48C223D301BFC0E8B6092D1B7.sk1.us-west-2.eks.amazonaws.com" -> (known after apply)
      ~ id                        = "********************" -> (known after apply)
      ~ identity                  = [
          - {
              - oidc = [
                  - {
                      - issuer = "https://oidc.eks.us-west-2.amazonaws.com/id/B3BA57C48C223D301BFC0E8B6092D1B7"
                    },
                ]
            },
        ] -> (known after apply)
      ~ kubernetes_network_config = [
          - {
              - ip_family         = "ipv4"
              - service_ipv4_cidr = "172.20.0.0/16"
            },
        ] -> (known after apply)
        name                      = "k8s-d6e0b7fc580c3a4d"
      ~ platform_version          = "eks.4" -> (known after apply)
      ~ role_arn                  = "arn:aws:iam::821341638715:role/k8s-d6e0b7fc580c3a4d-cluster-20220303174638717300000003" -> (known after apply)
      ~ status                    = "ACTIVE" -> (known after apply)
      ~ tags                      = {
          - "domain" = "solrcloud-k8s.ssb.data.gov"
        } -> (known after apply)
      ~ version                   = "1.21" -> (known after apply)
      ~ vpc_config                = [
          - {
              - cluster_security_group_id = "********************"
              - endpoint_private_access   = false
              - endpoint_public_access    = true
              - public_access_cidrs       = [
                  - "0.0.0.0/0",
                ]
              - security_group_ids        = [
                  - "sg-05b3c6ab8ba4310ae",
                ]
              - subnet_ids                = [
                  - "subnet-007e6f63e73ede610",
                  - "subnet-00bd6b66d9fd6ad48",
                  - "subnet-0e416adf62875f88a",
                ]
              - vpc_id                    = "*********************"
            },
        ] -> (known after apply)
    }

  # module.brokerpak-eks-terraform.module.provision.module.aws_load_balancer_controller.data.aws_eks_cluster_auth.selected[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster_auth" "selected"  {
      ~ id    = "********************" -> (known after apply)
        name  = "k8s-d6e0b7fc580c3a4d"
      ~ token = (sensitive value)
    }

  # module.brokerpak-eks-terraform.module.provision.module.aws_load_balancer_controller.data.aws_iam_policy_document.eks_oidc_assume_role[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "eks_oidc_assume_role"  {
      ~ id      = "*********" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - oidc.eks.us-west-2.amazonaws.com/id/B3BA57C48C223D301BFC0E8B6092D1B7:sub = "**************************************************************"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::821341638715:oidc-provider/oidc.eks.us-west-2.amazonaws.com/id/B3BA57C48C223D301BFC0E8B6092D1B7"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
          - resources     = [] -> null
            # (2 unchanged attributes hidden)

          - condition {
              - test     = "StringEquals" -> null
              - values   = [
                  - "system:serviceaccount:kube-system:aws-load-balancer-controller",
                ] -> null
              - variable = "oidc.eks.us-west-2.amazonaws.com/id/B3BA57C48C223D301BFC0E8B6092D1B7:sub" -> null
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:kube-system:aws-load-balancer-controller",
                ]
              + variable = (known after apply)
            }

          - principals {
              - identifiers = [
                  - "arn:aws:iam::821341638715:oidc-provider/oidc.eks.us-west-2.amazonaws.com/id/B3BA57C48C223D301BFC0E8B6092D1B7",
                ] -> null
              - type        = "Federated" -> null
            }
          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.brokerpak-eks-terraform.module.provision.module.aws_load_balancer_controller.data.aws_region.current will be read during apply
  # (config refers to values not yet known)
 <= data "aws_region" "current"  {
      ~ description = "US West (Oregon)" -> (known after apply)
      ~ endpoint    = "ec2.us-west-2.amazonaws.com" -> (known after apply)
      ~ id          = "*********" -> (known after apply)
        name        = "us-west-2"
    }

  # module.brokerpak-eks-terraform.module.provision.module.aws_load_balancer_controller.data.aws_vpc.selected will be read during apply
  # (config refers to values not yet known)
 <= data "aws_vpc" "selected"  {
      ~ arn                     = "arn:aws:ec2:us-west-2:821341638715:vpc/vpc-06206f07a9825cb47" -> (known after apply)
      ~ cidr_block              = "10.31.0.0/16" -> (known after apply)
      ~ cidr_block_associations = [
          - {
              - association_id = "********************************"
              - cidr_block     = "10.31.0.0/16"
              - state          = "associated"
            },
        ] -> (known after apply)
      ~ default                 = false -> (known after apply)
      ~ dhcp_options_id         = "*************" -> (known after apply)
      ~ enable_dns_hostnames    = true -> (known after apply)
      ~ enable_dns_support      = true -> (known after apply)
      ~ id                      = "*********************" -> (known after apply)
      ~ instance_tenancy        = "default" -> (known after apply)
      + ipv6_association_id     = (known after apply)
      + ipv6_cidr_block         = (known after apply)
      ~ main_route_table_id     = "*********************" -> (known after apply)
      ~ owner_id                = "************" -> (known after apply)
      + state                   = (known after apply)
      ~ tags                    = {
          - "Name"                                       = "eks-vpc"
          - "domain"                                     = "solrcloud-k8s.ssb.data.gov"
          - "kubernetes.io/cluster/k8s-d6e0b7fc580c3a4d" = "shared"
        } -> (known after apply)
    }

  # module.brokerpak-eks-terraform.module.provision.module.aws_load_balancer_controller.data.template_file.kubeconfig will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "kubeconfig"  {
      ~ id       = "****************************************************************" -> (known after apply)
      ~ rendered = <<-EOT
            apiVersion: v1
            kind: Config
            current-context: terraform
            clusters:
            - name: k8s-d6e0b7fc580c3a4d
              cluster:
                certificate-authority-data: LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUM1ekNDQWMrZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJeU1ETXdNekUzTlRVek9Wb1hEVE15TURJeU9URTNOVFV6T1Zvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTThWCjhpTWdVQmF5RmdockU2WFRUcFFRNFU5YmVqbVM3QVBtQi9yMExpeUovUVFtcHVVVmNHNEVzUDlIcmJqbHl5ZGUKUVNkSldEZEloRkRXeVJKQVExRXZPaXdQcEJpb01lT2VIMDhmbDdXVWZIN1Y0enhWODNmTGhGeWh0S1lXV1E0NQpQVlFwak5mdnpUNWpKQUd2YXd2TWlGWWxLNWRHanJPdUYyMktlazVVeWJmbnZiMHdXUS80SytEWDlGai9BMjdBCmtmV2VnSEdtUFB4U0RqQ0REcTZLK3pDRlNuRU11aDl0MXlUK3RPREdnNHFqK2NHdGM0WTk0L1FrVGMxMkhhVGoKc2dtWjh2MmZONlg0UFk0QzNZVktDbzA3Y09KUTNFcUFDdkFlZW0wTU16aW1IWXJuZE9sVjlTT3ZMMUVQZWJVRQpjSlhyaE9UM05QaDVGZmlHQW8wQ0F3RUFBYU5DTUVBd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0hRWURWUjBPQkJZRUZHUUJkdmZ0KzFza1NTTUlDa3N1SVcraFNJNWlNQTBHQ1NxR1NJYjMKRFFFQkN3VUFBNElCQVFDMGwvODkwMzRxOFhraG5TdkRsRUcxOFo4RXZ5V3FWR3JZdmtWc3MrQU1NdjNqdERKZApOSEFBNGJUdlM0NGtSN2ZUV0FXWlh3M1RHeDdrQXhEL2RtalNhVkVxYnorTWxlcTVSYTYvNTdnU2dvTGZkQzBqCnZNN1VnUmJORHJlUWdJQ2Y5MnR2Mnh4bG5IQjNuVnhNdWlydzVGUlZaOW4zaHRPVlp0UDJZZFptUFQyNVpxc0EKQTI4NjJKcnZTV1ZtTWROZDRqd3hsZ0ROUlpHUVlWeGlGbVhxdVdMTVRXVWd4NkNnSkdiNlFDSEQxNkpYOEhPegpjSkRpVG0wL3FyVHljTVp6TWc5YlFZaWh3bC9IYVovN1ZxcWdkVGhOKzBjUFhZYVFVTlZiTmZqeGdiQ2ZVMHFqCll5OVhYeS93N0dMdUs5NFRpcnZIQU14TXZsL05jb0tqWTZEZQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg==
                server: https://B3BA57C48C223D301BFC0E8B6092D1B7.sk1.us-west-2.eks.amazonaws.com
            contexts:
            - name: terraform
              context:
                cluster: k8s-d6e0b7fc580c3a4d
                user: terraform
            users:
            - name: terraform
              user:
                token: k8s-aws-v1.aHR0cHM6Ly9zdHMuYW1hem9uYXdzLmNvbS8_QWN0aW9uPUdldENhbGxlcklkZW50aXR5JlZlcnNpb249MjAxMS0wNi0xNSZYLUFtei1BbGdvcml0aG09QVdTNC1ITUFDLVNIQTI1NiZYLUFtei1DcmVkZW50aWFsPUFLSUEzNk82RzJBNVFGSlVFTzNFJTJGMjAyMjAzMDMlMkZ1cy1lYXN0LTElMkZzdHMlMkZhd3M0X3JlcXVlc3QmWC1BbXotRGF0ZT0yMDIyMDMwM1QxODEwNDBaJlgtQW16LUV4cGlyZXM9MCZYLUFtei1TaWduZWRIZWFkZXJzPWhvc3QlM0J4LWs4cy1hd3MtaWQmWC1BbXotU2lnbmF0dXJlPTVhOWM3MDA5NzY1ODQ1ZDIzZDIxYjQzMTA4NGYwMDE0ZjJlZmQzMzJjNmJmYmUzZGY2ODVjMmEzYTUyMzMzMTE
        EOT -> (known after apply)
      ~ template = (sensitive) -> (sensitive)
    }

  # module.brokerpak-eks-terraform.module.provision.module.aws_load_balancer_controller.aws_iam_role.this will be updated in-place
  ~ resource "aws_iam_role" "this" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - oidc.eks.us-west-2.amazonaws.com/id/B3BA57C48C223D301BFC0E8B6092D1B7:sub = "**************************************************************"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::821341638715:oidc-provider/oidc.eks.us-west-2.amazonaws.com/id/B3BA57C48C223D301BFC0E8B6092D1B7"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "k8s-k8s-d6e0b7fc580c3a4d-aws-load-balancer-controller"
        name                  = "k8s-k8s-d6e0b7fc580c3a4d-aws-load-balancer-controller"
        tags                  = {
            "domain" = "solrcloud-k8s.ssb.data.gov"
        }
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.brokerpak-eks-terraform.module.provision.module.aws_load_balancer_controller.helm_release.alb_controller will be updated in-place
  ~ resource "helm_release" "alb_controller" {
        id                         = "aws-load-balancer-controller"
        name                       = "aws-load-balancer-controller"
        # (26 unchanged attributes hidden)

      - set {
          - name  = "clusterName" -> null
          - value = "k8s-d6e0b7fc580c3a4d" -> null
        }
      + set {
          + name  = "clusterName"
          + value = "k8s-d6e0b7fc580c3a4d"
        }
      - set {
          - name  = "hostNetwork" -> null
          - value = "false" -> null
        }
      + set {
          + name  = "hostNetwork"
          + value = "false"
        }
      - set {
          - name  = "region" -> null
          - value = "us-west-2" -> null
        }
      + set {
          + name  = "region"
          + value = "us-west-2"
        }
      - set {
          - name  = "serviceAccount.create" -> null
          - value = "false" -> null
        }
      + set {
          + name  = "serviceAccount.create"
          + value = "false"
        }
      - set {
          - name  = "serviceAccount.name" -> null
          - value = "aws-load-balancer-controller" -> null
        }
      + set {
          + name  = "serviceAccount.name"
          + value = "aws-load-balancer-controller"
        }
      - set {
          - name  = "vpcId" -> null
          - value = "vpc-06206f07a9825cb47" -> null
        }
      + set {
          + name  = "vpcId"
          + value = (known after apply)
        }
    }

  # module.brokerpak-eks-terraform.module.provision.module.eks.module.eks_managed_node_group["system_node_group"].aws_eks_node_group.this[0] will be updated in-place
  ~ resource "aws_eks_node_group" "this" {
        id                     = "k8s-d6e0b7fc580c3a4d:mng-d6e0b7fc580c3a4d-20220303180249755300000012"
        tags                   = {
            "Name"   = "mng-d6e0b7fc580c3a4d"
            "domain" = "solrcloud-k8s.ssb.data.gov"
        }
        # (16 unchanged attributes hidden)

      ~ launch_template {
            id      = "lt-0f4e3132f3cb74cee"
            name    = "system_node_group-2022030318024840970000000f"
          ~ version = "1" -> (known after apply)
        }

      ~ scaling_config {
          ~ max_size     = 14 -> 40
            # (2 unchanged attributes hidden)
        }


        # (2 unchanged blocks hidden)
    }

  # module.brokerpak-eks-terraform.module.provision.module.eks.module.eks_managed_node_group["system_node_group"].aws_launch_template.this[0] will be updated in-place
  ~ resource "aws_launch_template" "this" {
      ~ default_version         = 1 -> (known after apply)
        id                      = "lt-0f4e3132f3cb74cee"
      ~ latest_version          = 1 -> (known after apply)
        name                    = "system_node_group-2022030318024840970000000f"
        tags                    = {
            "domain" = "solrcloud-k8s.ssb.data.gov"
        }
        # (8 unchanged attributes hidden)

      + block_device_mappings {
          + device_name = "/dev/xvda"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "***************************************************************************"
              + volume_size           = 20
            }
        }



        # (5 unchanged blocks hidden)
    }

Plan: 1 to add, 9 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [plan #200](https://github.com/GSA/datagov-ssb/actions/runs/1930592325)